In [1]:
"""Task
1.load a csv, set new column names
2.remame column namw(1 column, multiple column)
3.Load a data set,set one column as index column
4.Split your data into multiple files with repeat to rows and columns
Load the different files and merge the different files """

'Task\n1.load a csv, set new column names\n2.remame column namw(1 column, multiple column)\n3.Load a data set,set one column as index column\n4.Split your data into multiple files with repeat to rows and columns\nLoad the different files and merge the different files '

In [2]:
import pandas as pd

In [3]:
data= pd.read_csv("orders.csv",header= None)

In [4]:
data

      0          1   2     3      4
0  OD01    Tshirts  84   200  16800
1  OD02  Badminton  20   500  10000
2  OD03     Tennis  23  1000  23000
3  OD04       Ball  67    50   3350
4  OD05        Bat  21   500  10500

In [5]:
data.columns=["ItemCode","Item","Quantity","Price","Total"]

In [6]:
data

  ItemCode       Item  Quantity  Price  Total
0     OD01    Tshirts        84    200  16800
1     OD02  Badminton        20    500  10000
2     OD03     Tennis        23   1000  23000
3     OD04       Ball        67     50   3350
4     OD05        Bat        21    500  10500

In [7]:
data.rename(columns= {"Price":"Price per piece"},inplace=True)

In [8]:
data

  ItemCode       Item  Quantity  Price per piece  Total
0     OD01    Tshirts        84              200  16800
1     OD02  Badminton        20              500  10000
2     OD03     Tennis        23             1000  23000
3     OD04       Ball        67               50   3350
4     OD05        Bat        21              500  10500

In [9]:
data.rename(columns= {"Item":"Item name","Quantity":"No. of items" },inplace=True)

In [10]:
data

  ItemCode  Item name  No. of items  Price per piece  Total
0     OD01    Tshirts            84              200  16800
1     OD02  Badminton            20              500  10000
2     OD03     Tennis            23             1000  23000
3     OD04       Ball            67               50   3350
4     OD05        Bat            21              500  10500

In [11]:
data.set_index("ItemCode")

          Item name  No. of items  Price per piece  Total
ItemCode
OD01        Tshirts            84              200  16800
OD02      Badminton            20              500  10000
OD03         Tennis            23             1000  23000
OD04           Ball            67               50   3350
OD05            Bat            21              500  10500

In [12]:
data

  ItemCode  Item name  No. of items  Price per piece  Total
0     OD01    Tshirts            84              200  16800
1     OD02  Badminton            20              500  10000
2     OD03     Tennis            23             1000  23000
3     OD04       Ball            67               50   3350
4     OD05        Bat            21              500  10500

In [13]:
datafile= pd.read

AttributeError: module 'pandas' has no attribute 'read'